#include <stdio.h>

/***********************************************************************
*   多级指针:  指针中保存其他指针的地址
    指针的类型:  *ptr1 一级指针
                **ptr1 二级指针  

     int ***ptr3：三级指针
      解引用三级指针获取目标数据（num=10）: ***ptr3 
      
      ***ptr3: 
               1.使用指针变量的名字直接获取该指针中的值(二级指针的地址)
               2.*ptr3  获取二级指针保存的值(一级指针的地址) 
               3. **ptr3 获取一级指针的值(num变量的地址)
               4. ***ptr3 获取num变量的值

***********************************************************************/

int main(){
   int num=10;
   int *ptr1=&num;//数据的内存地址保存到一级指针中
   int **ptr2=&ptr1;// 保存ptr1指针的地址  把ptr2二级指针
   int ***ptr3=&ptr2;// 保存ptr2指针的地址  把ptr3三级指针


   //对指针进行解引用
   printf("%p,%d\n",&num,num);
   printf("%p,%p,%d\n",ptr1,&ptr1,*ptr1);
   printf("%p,%p,%p,%d\n",*ptr2,&ptr2,ptr2,**ptr2);
   printf("%p,%p,%p,%d\n",**ptr3,ptr3,*ptr3,***ptr3);




    return 0;
}