#include <stdio.h>
/***********************************************************************
&	按位与	    2	无                     对两个操作数的补码进行按位与运算: 每个对应位的值都是1结果为1,有零结果为0   (全1为1,有0为0)
|	按位或	    2	无                     对两个操作数的补码进行按位或运算: 每个对应位的值只要有一个1结果为1,全都是零结果为0  (有1为1,全0为0)
^	按位异或	2	无                     对两个操作数的补码进行按位或运算: 每个对应位的值不相同结果为1,结果相同为0 (不同为1 相同为0)
~	按位取反 	1	无                     把补码的每一位进行取反(0->1  或者 1->0)
<<	按位左移	2	无                     补码的每一位整体左移 (高位溢出的删除,低位补零)
>>	按位右移	2	无                     补码的每一位整体右移 (低位溢出的删除,(正数)高位补零,负数:(高位补1))

        原码              反码               补码
17:    0001 0001         0001 0001           0001 0001
-12:   1000 1100         1111 0011           1111 0100


17 & -12：                                  00010000

17 | -12： 10001011      11110100           11110101

17 ^ -12:  1001 1011     1110 0100          1110 0101

~17:       1001 0010     1110 1101          1110 1110
~-12:      0000 1010     0000 1011          0000 1011


17<<2:                                      01 000100
17>>2                                       000001 00


-12<<2:   10 110000       11 001111         11 010000

-12>>2:   10 0000 11      11 1111 00        11 1111 01

左右移的简化计算方式:
 左移: 目标数 * （2的 移动的位数次方）
 右移：目标数 / （2的 移动的位数次方） 注意: 取最小的整数
***********************************************************************/
int main()
{

    int a = 17, b = -12;
    printf("a & b =%d\n", a & b);
    printf("a | b =%d\n", a | b);
    printf("a ^ b =%d\n", a ^ b);

    printf("~a=%d\n", ~a);
    printf("~b=%d\n", ~b);

    printf("a<<2=%d\n", a << 2);
    printf("a>>2=%d\n", a >> 2);

    printf("b<<2=%d\n", b << 2);
    printf("b>>2=%d\n", b >> 2);
    printf("b>>3=%d\n", b >> 3);


  //a和b变量中的数据进行交换
    //声明一个临时变量
    // int temp=a;
    // a=b;
    // b=temp;
    // printf("%d,%d",a,b);


//    a=a^b;
//    b=a^b;
//    a=a^b;
//    printf("%d,%d",a,b);
    return 0;
}