#include <stdio.h>
/***********************************************************************
*  算术运算符:
   +  正号                    1个操作数                 无副作用
   -  负号                    1个操作数                 无副作用
   +  加                      2个操作数                 无副作用
   -  减                      2个操作数                 无副作用
   *  乘                      2个操作数                 无副作用
   /  除                      2个操作数                 无副作用
   %  取模(取余)               2个操作数                 无副作用
   ++ 自增                    1个操作数                 有副作用               操作数在符号前(先取值 再运算)         操作数在符号后(先运算 再赋值)
   -- 自减                    1个操作数                 有副作用               操作数在符号前(先取值 再运算)         操作数在符号后(先运算 再赋值)





***********************************************************************/
int main()
{
    int a = 9, b = -2;
    /*    double c=2; */
    /*    printf("%d\n",+a);
       printf("%d\n",-a);

       printf("%d\n",+b);
       printf("%d\n",-b);
       printf("%d\n",b); */
    /*
       printf("a*b=%d\n",a*b);
       printf("a/b=%d\n",a/b);
       printf("a%b=%d\n",a%b);


       printf("a*c=%.2lf",a*c); */

    //    a++;//等价于a=a+1
    // a=a+1;
    //  printf("a=%d\n", ++a);
    //  printf("a=%d\n",a);

    /*  printf("a=%d\n", --a);
     printf("a=%d\n",a); */



    a++;
    printf("a=%d\n",a++);
    printf("a=%d\n",--a);
    printf("a=%d\n",a);


    return 0;
}