#include <stdio.h>
/***********************************************************************
*   比较运算符(关系运算符):   两个操作数     没有副作用    结果是bool类型

    使用场景: 在分支语句(作为判断的条件)或者循环语句中使用 

***********************************************************************/
int main(){
   int a=10,b=20;
   printf("a>b=%d\n",a>b);//false(0)
   printf("a<b=%d\n",a<b);//true(1)
   printf("a==b=%d\n",a==b);//false(0)(比较变量a和b中的值是否相等)
   printf("a>=b=%d\n",a>=b);//false(0)
   printf("a<=b=%d\n",a<=b);//true(1)
   printf("a!=b=%d\n",a!=b);//true(1)
    return 0;
}