#include <stdio.h>
/***********************************************************************
*   循环体中的break: 结束整个循环，执行循环后面的代码
    break在循环中的使用场景: 配合if语句使用



    循环中的continue： 跳过本次循环进入下一次循环
***********************************************************************/
int main()
{
    //    for (int i = 0; i < 10; i++)
    //    {
    //       printf("%d ",i);
    //       break;
    //    }

    // 打印 1-10的数字,如果遇到3就结束循环

    for (int i = 1; i < 10; i++)
    {
        if (i == 3)
        {
            break;
        }
        printf("%d ", i);
    }

    printf("\n");
    // 打印 1-10的数字,如果遇到3就跳过,继续打印3之后的数字
    for (int i = 1; i < 10; i++)
    {
        if (i == 3)
        {
            continue;
        }
        printf("%d ", i);
    }

    // 输出100以内（包括100）的数字，跳过那些7的倍数或包含7的数字。

    printf("\n");
    for (int i = 0; i <=100; i++)
    {
        if(i%7==0 || i%10==7 || i/10==7){
             continue;
        }
        printf("%d\n",i);
    }



    return 0;
}