#include <stdio.h>
/***********************************************************************
*  while: 关键字(循环)
   (): 循环判断的条件 （对循环变量进行判断）
   {}: 循环体(代码块)
   循环变量: 循环条件中的变量，在循环执行的过程中要改变它的值(趋近于结束条件)
   循环变量的变化也是循环体的一部分
***********************************************************************/
int main()
{
    // （1）输出10次 "我第n天吃了n个韭菜馅的包子"。

    //  int day=1;
    //  while(day<=10){
    //     printf("我第%d天吃了%d个韭菜馅的包子\n",day,day);
    //     day++;
    //  }

    // （2）循环输出数字 7~15
    // int num = 7;
    // while (num <= 15)
    // {
    //     printf("%d\n", num);
    //     num++;
    // }

    // （3）倒序输出数字 56 ~ 43
    // int num=56;
    // while (num>=43)
    // {
    //      printf("%d\n", num);
    //      num--;
    // }

    // （4）输出10（包括10）以内所有的偶数
    //  int num=0;
    //  while (num<=10)
    //  {
    //      printf("%d\t",num);
    //      num+=2;
    //  }
    // int num = 0;
    // while (num <= 10)
    // {
    //     if(num % 2==0){
    //           printf("%d\t", num);
    //     }
    //     num ++;
    // }
    // （5）计算100以内（包括100）所有数字的和
    // int num = 1; // 循环变量
    // int sum = 0; // 和
    // while (num <= 100)
    // {
    //     //    sum=sum+num;
    //     sum += num;
    //     num++;
    // }
    // printf("%d\n",sum);
    // printf("%d\n",num);

// （6）计算10以内所有奇数的乘积

//    int num=3;//循环变量
//    int product=1;//乘积
//    while (num<10)
//    {
//       product=product* num;
//       num+=2;
//    }
//    printf("%d\n",product);
//    printf("%d\n",num);



/***********************************************************************
*  不确定循环直到循环表达式不成立之前，不确定循环次数，不需要循环变量。
   实现需求：输入6位数密码，直到密码匹配成功结束循环。
***********************************************************************/
    int pwd1=123456;//原始密码
    int inputPwd;//输入的密码
    scanf("%d",&inputPwd);

    while (pwd1!=inputPwd) //密码匹配失败,继续循环匹配
    {
       printf("重新输入密码:");
       scanf("%d",&inputPwd);//循环变量的变化
    }
    
    printf("欢迎回家!!!");


    return 0;
}