#include <stdio.h>
/***********************************************************************
*   int nums[]; 一维数组，int[]是数组的类型
    int nums[2][3] 二维数组  int[][] 是数组的类型


    nums:二维数组的名字
    nums[i]: 二维数组的行
    nums[i][j]: 二维数组的列
***********************************************************************/

int main()
{
    // int nums[2][3]; // 二维数组

    // 使用下标的方式给数组赋值
    //  nums[0][0] = 1;
    //  nums[0][1] = 1;
    //  nums[0][2] = 1;

    // nums[1][0] = 1;
    // nums[1][1] = 1;
    // nums[1][2] = 1;

    int nums1[2][3] = {{10, 20, 30}, {100, 200, 300}};
    int nums2[2][3] = {
        {10, 20, 30},
        {100, 200, 300}};

    int nums3[2][3] = {10, 20, 30, 100, 200, 300};

    int nums4[][3] = {10, 20, 30, 100, 200, 300};

    for (int i = 0; i < 2; i++)
    {
        for (int j = 0; j < 3; j++)
        {
            printf("%d ", nums3[i][j]);
        }
        printf("\n");
    }

    return 0;
}