#include <stdio.h>

/***********************************************************************
*   数组: 对数组的元素进行查询效率是高的
          对数组的元素进行插入(对最后元素的插入效率高)，
          任意位置插入效率低(其他的元素移动)
          为什么移动: 数组的元素在内存中是连续的
***********************************************************************/

int main()
{
    // 5个长度的数组，初始化了3个有效的元素
    int nums[5] = {1, 2, 3};
    int size = 3;
    int a = 10; // 把a的数据添加到数组的3元素的后面
    nums[3] = a;
    size++;
    for (int i = 0; i < size; i++)
    {
        printf("%d ", nums[i]);
    }

    printf("\n");

    int b = 20; // 把b的值添加到数组元素2的位置（动态插入数组元素）

    // 向后面的位置移动(复制)元素
    for (int i = size - 1; i >= 1; i--)
    {
        // nums[i]=nums[i-1];
        nums[i + 1] = nums[i];
    }

    nums[1] = b;
    size++;

  for (int i = 0; i < size; i++)
    {
        printf("%d ", nums[i]);
    }
    return 0;
}