#include <stdio.h>

/***********************************************************************
 *  动态的删除数组的元素:
 *      1 删除的是最后一个元素效率高
 *      2 删除任意位置的数据效率低(移动元素)
 * 
 *    尽量少用插入和删除功能,(插入,删除 最后一个元素)
 * 
 ***********************************************************************/
int main()
{
    // 5个长度的数组，初始化了3个有效的元素
    int nums[5] = {1, 2, 3};
    int size = 3;
    // 删除数组最后一个元素
    nums[size - 1] = 0;
    // 实际个数减一
    size--;
    for (int i = 0; i < size; i++)
    {
        printf("%d ", nums[i]);
    }

    // 数组的元素向前移动
    for (int i = 1; i < size; i++)
    {
        // nums[i]=nums[i+1];
        nums[i - 1] = nums[i];
    }
    size--;
    printf("\n");
    for (int i = 0; i < size; i++)
    {
        printf("%d ", nums[i]);
    }

    return 0;
}