#include <stdio.h>
/***********************************************************************
*  %s: 自动把字符数组中所有字符获取到(以字符串的方式获取数据)
***********************************************************************/
int main(){
  //创建一个字符数组(字符串)
   char str1[6]={'a','b','c','d','e','\0'};//没有结束符\0
   char str2[4]={'t','o','m'};//没有结束符\0(有足够的空间,自动添加)
   char str3[]={'j','a','c','k','\0'};//没有结束符\0 (手动添加结束符)


 //创建字符数组的简化写法

  char str4[]={"hello"};// 自动添加结束符
  char str5[]="world!";// 自动添加结束符
  
  printf("%s",str5);

    return 0;
}